Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
er apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 2560
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/deidentifyFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/da0b156e7ec9acbe69f6b0b64b9c3b3c1c16e33e56ef46179bc54928d9131d18.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/da0b156e7ec9acbe69f6b0b64b9c3b3c1c16e33e56ef46179bc54928d9131d18.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/da0b156e7ec9acbe69f6b0b64b9c3b3c1c16e33e56ef46179bc54928d9131d18.zip"
          + "timestamp" = "1765967652786954000"
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-generateCohortVCfs"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-generateCohortVCfs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-generateCohortVCfs-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-generateCohortVCfs"
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-generateCohortVCfs-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-generateCohortVCfs"
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-generateCohortVCfs-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-generateCohortVCfs"
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-generateCohortVCfs-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-generateCohortVCfs"
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Backend function to generate reports."
      + filename                       = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
      + function_name                  = "sbeacon-backend-generateCohortVCfs"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateCohortVCfs/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateCohortVCfs",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          + "timestamp" = "1765967652827733000"
        }
    }

  # module.sbeacon.module.lambda-generateReports.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-generateReports"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-generateReports"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-generateReports-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-generateReports"
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-generateReports-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-generateReports"
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Backend function to generate reports."
      + filename                       = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip"
      + function_name                  = "sbeacon-backend-generateReports"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip"
          + "timestamp" = "1765967652334476000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getAnalyses"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getAnalyses"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getAnalyses-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getAnalyses"
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getAnalyses-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getAnalyses"
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getAnalyses-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getAnalyses"
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getAnalyses-3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getAnalyses"
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getAnalyses-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getAnalyses"
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the beacon map."
      + filename                       = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
      + function_name                  = "sbeacon-backend-getAnalyses"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getAnalyses",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          + "timestamp" = "1765967652467668000"
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getBiosamples"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getBiosamples"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getBiosamples-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getBiosamples"
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getBiosamples-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getBiosamples"
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getBiosamples-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getBiosamples"
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getBiosamples-3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getBiosamples"
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getBiosamples-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getBiosamples"
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the biosamples."
      + filename                       = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
      + function_name                  = "sbeacon-backend-getBiosamples"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getBiosamples",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          + "timestamp" = "1765967652934724000"
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getConfiguration"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getConfiguration"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getConfiguration-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getConfiguration"
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the beacon configuration."
      + filename                       = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
      + function_name                  = "sbeacon-backend-getConfiguration"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              + "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              + "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              + "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              + "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              + "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              + "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              + "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              + "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250725085316769800000002"
              + "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              + "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              + "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              + "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              + "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              + "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              + "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              + "ATHENA_WORKGROUP"                     = "query_workgroup"
              + "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              + "BEACON_API_VERSION"                   = "v2.0.0"
              + "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              + "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              + "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              + "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              + "BEACON_ENVIRONMENT"                   = "dev"
              + "BEACON_HANDOVERS"                     = jsonencode([])
              + "BEACON_ID"                            = "au.csiro.sbeacon"
              + "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              + "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              + "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              + "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              + "BEACON_ORG_ID"                        = "CSIRO"
              + "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              + "BEACON_ORG_NAME"                      = "CSIRO"
              + "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              + "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              + "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              + "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              + "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              + "BEACON_URI"                           = "https://beacon.csiro.au"
              + "BEACON_VERSION"                       = "v0.1.0"
              + "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              + "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              + "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              + "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              + "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              + "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              + "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              + "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getConfiguration",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          + "timestamp" = "1765967652886865000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getDatasets"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getDatasets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the datasets."
      + filename                       = "builds/ad5f6da155a973ac0d80dacb7831effd838f8be4d279cd21cce7eb06b32f958a.zip"
      + function_name                  = "sbeacon-backend-getDatasets"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ad5f6da155a973ac0d80dacb7831effd838f8be4d279cd21cce7eb06b32f958a.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ad5f6da155a973ac0d80dacb7831effd838f8be4d279cd21cce7eb06b32f958a.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/ad5f6da155a973ac0d80dacb7831effd838f8be4d279cd21cce7eb06b32f958a.zip"
          + "timestamp" = "1765967653138486000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getEntryTypes"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getEntryTypes"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getEntryTypes-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getEntryTypes"
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the beacon map."
      + filename                       = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
      + function_name                  = "sbeacon-backend-getEntryTypes"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              + "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              + "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              + "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              + "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              + "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              + "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              + "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              + "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-202507250853167
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.